# Summarize Data

In [1]:
df = sns.load_dataset('iris')
df.shape

(150, 5)

In [5]:
df.head(2)

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa

In [10]:
df['species'].value_counts()

versicolor    50
setosa        50
virginica     50
Name: species, dtype: int64

In [9]:
pd.DataFrame(df['species'].value_counts())

            species
versicolor       50
setosa           50
virginica        50

In [12]:
len(df)

150

In [17]:
df.shape[0]

150

In [18]:
df['species'].unique()

array(['setosa', 'versicolor', 'virginica'], dtype=object)

In [19]:
df['species'].nunique()

3

In [20]:
df['sepal_length'].unique()

array([5.1, 4.9, 4.7, 4.6, 5. , 5.4, 4.4, 4.8, 4.3, 5.8, 5.7, 5.2, 5.5,
       4.5, 5.3, 7. , 6.4, 6.9, 6.5, 6.3, 6.6, 5.9, 6. , 6.1, 5.6, 6.7,
       6.2, 6.8, 7.1, 7.6, 7.3, 7.2, 7.7, 7.4, 7.9])

In [21]:
df['sepal_length'].nunique()

35

In [24]:
df.describe() #수치형 데이터에 대한 기초통계량 보여줌

       sepal_length  sepal_width  petal_length  petal_width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.057333      3.758000     1.199333
std        0.828066     0.435866      1.765298     0.762238
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

In [27]:
df.describe(include = 'all')

        sepal_length  sepal_width  petal_length  petal_width     species
count     150.000000   150.000000    150.000000   150.000000         150
unique           NaN          NaN           NaN          NaN           3
top              NaN          NaN           NaN          NaN  versicolor
freq             NaN          NaN           NaN          NaN          50
mean        5.843333     3.057333      3.758000     1.199333         NaN
std         0.828066     0.435866      1.765298     0.762238         NaN
min         4.300000     2.000000      1.000000     0.100000         NaN
25%         5.100000     2.800000      1.600000     0.300000         NaN
50%         5.800000     3.000000      4.350000     1.300000         NaN
75%         6.400000     3.300000      5.100000     1.800000         NaN
max         7.900000     4.400000      6.900000     2.500000         NaN

In [31]:
df.describe(include = [np.object])

           species
count          150
unique           3
top     versicolor
freq            50

In [32]:
df.describe(include = [np.number])

       sepal_length  sepal_width  petal_length  petal_width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.057333      3.758000     1.199333
std        0.828066     0.435866      1.765298     0.762238
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

In [33]:
df['sepal_length'].sum()

876.5

In [34]:
df['sepal_length'].median()

5.8

In [35]:
df['sepal_length'].mean()

5.843333333333335

In [37]:
df['sepal_length'].quantile([0.25,0.75])

0.25    5.1
0.75    6.4
Name: sepal_length, dtype: float64

In [38]:
df['sepal_length'].min()

4.3

In [39]:
df['sepal_length'].max()

7.9

In [40]:
df['sepal_length'].var()

0.6856935123042505

In [41]:
df['sepal_length'].std()

0.8280661279778629

# apply (function)

In [47]:
# lambda 함수 적용
df['species'].apply(lambda x: x[:3])

0      set
1      set
2      set
3      set
4      set
      ...
145    vir
146    vir
147    vir
148    vir
149    vir
Name: species, Length: 150, dtype: object

# handling missing data (결측치 다루기)

1. df.dropna()

    1) df.dropna(axis=1,how='any')
        : axis=1 의미는 컬럼을 대상으로 하겠다는 의미
        : how='any' 의미는 하나라도 결측이 있다면 drop 의미

2. df.fillna()

    1) df.fillna(0) : 모든 결측치 0으로 채우겠다.



    2) fill_na_value = df['A'].mean()
       df.fillna(fill_na_value) : 모든 결측치를 A컬럼의 평균으로 채우겠다.
       
    3) df['sepal'].fillna(full_na_value) : 'sepal'컬럼의 결측치를 A컬럼의 평균으로 채우겠다.

    4) values = {'A':0,'B':1,'C':2}
       df.fillna(value=values) : df의 A열 결측치는 0으로, B열 결측치는 1로, C열 결측치는 2로 채우겠다.
       
       
3. df.isnull()

    1) df.isnull().sum() : null값의 갯수 표현
    
    2) df.notnull().sum() : notnull값의 갯수 표현

In [50]:
>>> df = pd.DataFrame({"name": ['Alfred', 'Batman', 'Catwoman'],
...                    "toy": [np.nan, 'Batmobile', 'Bullwhip'],
...                    "born": [pd.NaT, pd.Timestamp("1940-04-25"),
...                             pd.NaT]})

In [51]:
df

       name        toy       born
0    Alfred        NaN        NaT
1    Batman  Batmobile 1940-04-25
2  Catwoman   Bullwhip        NaT

In [52]:
df.dropna()

     name        toy       born
1  Batman  Batmobile 1940-04-25

In [55]:
# axis = 1 => 컬럼
# axis = 0 => 로우
# how = 'any', 하나라도 빈값 있으면 drop

df.dropna(axis=1,how='any')

       name
0    Alfred
1    Batman
2  Catwoman

In [56]:
df.dropna(axis=0,how='any')

     name        toy       born
1  Batman  Batmobile 1940-04-25

In [57]:
df.dropna(axis=1,how='all')

       name        toy       born
0    Alfred        NaN        NaT
1    Batman  Batmobile 1940-04-25
2  Catwoman   Bullwhip        NaT

In [60]:
df.fillna?

In [61]:
>>> df = pd.DataFrame([[np.nan, 2, np.nan, 0],
...                    [3, 4, np.nan, 1],
...                    [np.nan, np.nan, np.nan, 5],
...                    [np.nan, 3, np.nan, 4]],
...                   columns=list('ABCD'))

In [62]:
df

     A    B   C  D
0  NaN  2.0 NaN  0
1  3.0  4.0 NaN  1
2  NaN  NaN NaN  5
3  NaN  3.0 NaN  4

In [68]:
df.fillna(0)

     A    B    C  D
0  0.0  2.0  0.0  0
1  3.0  4.0  0.0  1
2  0.0  0.0  0.0  5
3  0.0  3.0  0.0  4

In [70]:
# { '채울 컬럼명' : 채울숫자 }
values = {'A' : 0, 'B' : 1, 'C' : 2, 'D' : 3}
df.fillna(value=values)

     A    B    C  D
0  0.0  2.0  2.0  0
1  3.0  4.0  2.0  1
2  0.0  1.0  2.0  5
3  0.0  3.0  2.0  4

In [77]:
fill_na_value = df['D'].median()

In [78]:
df.fillna(fill_na_value)

     A    B    C  D
0  2.5  2.0  2.5  0
1  3.0  4.0  2.5  1
2  2.5  2.5  2.5  5
3  2.5  3.0  2.5  4

In [79]:
df.isnull()

       A      B     C      D
0   True  False  True  False
1  False  False  True  False
2   True   True  True  False
3   True  False  True  False

In [80]:
df.isnull().sum()

A    3
B    1
C    4
D    0
dtype: int64

# make new columns

- 1. df.assign(ln_A = lambda x: np.log(x.A))
- 2. df['new column'] = 새로운 데이터
- 3. df.quct() ===>> vector function
- 4. df.max, min()
- 5. df.clip() ===>> 임계치만큼 trim
- 6. df.abs()===>> 절대값으로

In [110]:
df = pd.DataFrame({'A':range(1,11), 'B':np.random.randn(10)})
df

    A         B
0   1 -1.347279
1   2  1.401590
2   3 -1.140042
3   4  1.809064
4   5  0.072214
5   6  1.026588
6   7 -0.497916
7   8 -1.043037
8   9  0.667155
9  10  0.667508

In [111]:
df.assign(ln_A = lambda x: np.log(x.A)).head()

   A         B      ln_A
0  1 -1.347279  0.000000
1  2  1.401590  0.693147
2  3 -1.140042  1.098612
3  4  1.809064  1.386294
4  5  0.072214  1.609438

In [112]:
df['ln_A'] = np.log(df.A)
df

    A         B      ln_A
0   1 -1.347279  0.000000
1   2  1.401590  0.693147
2   3 -1.140042  1.098612
3   4  1.809064  1.386294
4   5  0.072214  1.609438
5   6  1.026588  1.791759
6   7 -0.497916  1.945910
7   8 -1.043037  2.079442
8   9  0.667155  2.197225
9  10  0.667508  2.302585

In [116]:
#5개의 리스트 값을 가지고 와서 3개의 빈, bucket으로 만들어주기

pd.qcut(range(5), 3, labels=["good", "medium", "bad"])

[good, good, medium, bad, bad]
Categories (3, object): [good < medium < bad]

In [120]:
pd.qcut(df.B, 3, labels=["good","medium", "bad"])

0      good
1       bad
2      good
3       bad
4    medium
5       bad
6      good
7      good
8    medium
9    medium
Name: B, dtype: category
Categories (3, object): [good < medium < bad]

In [128]:
# axis = 1, 행에서 각 열의 값 중 최대값을 가지고 옴
df.max(axis=1)

0     1.0
1     2.0
2     3.0
3     4.0
4     5.0
5     6.0
6     7.0
7     8.0
8     9.0
9    10.0
dtype: float64

In [129]:
# 해당 열에서 각 행 값들 중 최대값을 가져옴
df.max(axis=0)

A       10.000000
B        1.809064
ln_A     2.302585
dtype: float64

In [131]:
df['A'].clip(lower = 3,upper=5)

0    3
1    3
2    3
3    4
4    5
5    5
6    5
7    5
8    5
9    5
Name: A, dtype: int64

In [135]:
df.abs()

      A         B      ln_A
0   1.0  1.347279  0.000000
1   2.0  1.401590  0.693147
2   3.0  1.140042  1.098612
3   4.0  1.809064  1.386294
4   5.0  0.072214  1.609438
5   6.0  1.026588  1.791759
6   7.0  0.497916  1.945910
7   8.0  1.043037  2.079442
8   9.0  0.667155  2.197225
9  10.0  0.667508  2.302585